
&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	
	Адрес = ПоместитьКорзинуВоВременноеХранилище();
	ОповеститьОВыборе(Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Фильтр = Новый СТруктура;
	Фильтр.Вставить("Товар", ВыбраннаяСтрока);
	
	НайденныеСтроки = ВыбраннаяНоменклатура.НайтиСтроки(Фильтр);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Строка = НайденныеСтроки[0];
		Строка.Количество = Строка.Количество + 1;
	Иначе
		Строка = ВыбраннаяНоменклатура.Добавить();
		Строка.Товар = ВыбраннаяСтрока;
		Строка.Количество = 1;
		Строка.Цена = ТекущиеДанные.Цена;
	КонецЕсли;
		

КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	Если СтрокаТЧ.Товар <> Неопределено Тогда
		СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
		ПересчитатьПозицию(СтрокаТЧ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
	СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ВыбраннаяНоменклатура.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
КонецПроцедуры

Процедура ПересчитатьПозицию(СтрокаТЧ)
    // Устанавливаем количество по умолчанию
    Если СтрокаТЧ.Количество <= 0 Или СтрокаТЧ.Количество = Неопределено Тогда
        СтрокаТЧ.Количество = 1;
    КонецЕсли;
    
    // Считаем сумму позиции
    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦенуТовара(Товар)
    Возврат ПолучитьЦенуТовараНаСервере(Товар, ТекущаяДата());
КонецФункции

&НаСервере
Функция ПолучитьЦенуТовараНаСервере(Товар, Дата)
    Возврат РаботаСЦенамиВызовСервера.ПолучитьЦенуТовара(Товар);
КонецФункции

&НаСервере

Функция ПоместитьКорзинуВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ВыбраннаяНоменклатура.Выгрузить());
	
КонецФункции