
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммы()
	
    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    
    Если ТекущаяСтрока <> Неопределено Тогда

        ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
    КонецЕсли;

    ОбщаяСумма = 0;
    Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
        ОбщаяСумма = ОбщаяСумма + СтрокаТаблицы.Сумма;
    КонецЦикла;
    
    Объект.СуммаДокумента = ОбщаяСумма;
    	
КонецПроцедуры