Функция ПодготовитьАрхив() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Должность) КАК Должность,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Телефон) КАК Телефон,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Email) КАК Email,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.ИдентификаторПользователяИБ) КАК Идентификатор,
		|	Сотрудники.Фото КАК Фото
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ЭтоГруппа = ЛОЖЬ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	
	ОписаниеСотрудников = Новый Массив;
	
	ШаблонИмениКартинки = "%1%2img%2%3.jpg";
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеСотрудника = Новый Структура;
		ОписаниеСотрудника.Вставить("Идентификатор", Выборка.Идентификатор);
		ОписаниеСотрудника.Вставить("Сотрудник", Выборка.Сотрудник);
		ОписаниеСотрудника.Вставить("Должность", Выборка.Должность);
		ОписаниеСотрудника.Вставить("Телефон", Выборка.Телефон);
		ОписаниеСотрудника.Вставить("Email", Выборка.Email);
		
		ДанныеФото = Выборка.Фото.Получить();
		
		Если ДанныеФото = Неопределено Тогда
			ОписаниеСотрудника.Вставить("Фото", Неопределено);
		Иначе
			ИмяФайла = СтрШаблон(ШаблонИмениКартинки, ИмяКаталога, ПолучитьРазделительПути(), Выборка.Идентификатор);
			ДанныеФото.Записать(ИмяФайла);
			ОписаниеСотрудника.Вставить("Фото", СтрШаблон(ШаблонИмениКартинки, "", ПолучитьРазделительПути(), Выборка.Идентификатор));
		КонецЕсли;
		
		ОписаниеСотрудников.Добавить(ОписаниеСотрудника);
		
	КонецЦикла;
	
	ШаблонИмениФайлаВыгрузки = "%1%2export.json";
	ИмяФайлаВыгрузки = СтрШаблон(ШаблонИмениФайлаВыгрузки, ИмяКаталога, ПолучитьРазделительПути());
	
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеСотрудников);
	Запись.Закрыть();
	
	Архиватор = Новый ЗаписьФайлаАрхива();
	Архиватор.Добавить(ИмяКаталога + ПолучитьРазделительПути() + "*.*",,РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();
	
	
	
	УдалитьФайлы(ИмяКаталога);
	
	Возврат ДанныеАрхива;

КонецФункции