
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПитомцев();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	Если Объект.ДатаРождения > ТекущаяДата() Тогда
		Объект.ДатаРождения = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата рождения не может быть больше, чем сегодняшняя дата!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Объект.ДатаРождения < Дата(1920, 01, 01) Тогда
		Объект.ДатаРождения = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите корректный возраст!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьПитомцев(Команда)
	ЗаполнитьПитомцев();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьПитомца(Команда)
	Если Не Ждать ПроверитьЗаписьКлиента() Тогда
        Возврат;
    КонецЕсли;
    
    ОткрытьФормуСозданияПитомца();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Асинх Функция ПроверитьЗаписьКлиента()
    
    Если Модифицированность Тогда
        
        Ответ = Ждать ВопросАсинх(НСтр("ru = 'Записать клиента?'"), РежимДиалогаВопрос.ДаНет);
        
        Если Ответ = КодВозвратаДиалога.Да Тогда

            Попытка
                Записать();
                Возврат Истина;
            Исключение
                Сообщить("Ошибка при записи клиента: " + ОписаниеОшибки());
                Возврат Ложь;
            КонецПопытки;
        Иначе

            Возврат Ложь;
        КонецЕсли;
        
    Иначе

        Возврат Истина;
    КонецЕсли;
    
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСозданияПитомца()
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Режим", "Добавление");
    ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
    
    ОткрытьФорму("Справочник.Питомцы.Форма.ФормаЭлемента", ПараметрыФормы);
    
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПитомцев()
	
	Объект.Питомцы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Питомцы.ВидЖивотного КАК ВидЖивотного,
	|	Питомцы.ПородаЖивотного КАК ПородаЖивотного,
	|	Питомцы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Питомцы КАК Питомцы
	|ГДЕ
	|	Питомцы.Хозяин = &Хозяин";
	
	Запрос.УстановитьПараметр("Хозяин", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Питомцы.Добавить();
		НоваяСтрока.Кличка = Выборка.Ссылка;
		НоваяСтрока.ВидЖивотного = Выборка.ВидЖивотного;
		НоваяСтрока.ПородаЖивотного = Выборка.ПородаЖивотного
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
