
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СтатусЗаписи = Перечисления.СтатусыЗаписи.Запланирован;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.СтатусЗаписи = Неопределено Тогда
		Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если Объект.Услуга <> Неопределено Тогда
        // Выполним запрос к базе данных, чтобы получить продолжительность услуги
        Продолжительность = ПолучитьПродолжительностьУслуги(Объект.Услуга);
        Объект.Продолжительность = Продолжительность;
    Иначе
        Объект.Продолжительность = 30;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу)
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Услуги.Продолжительность КАК Продолжительность
        |ИЗ
        |	Справочник.Услуги КАК Услуги
        |ГДЕ
        |	Услуги.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаУслугу);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Продолжительность;
    Иначе
        Возврат 30;
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьПродолжительностьУслуги(СсылкаНаУслугу)
    Возврат ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу);
КонецФункции

#КонецОбласти
