
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.ПустаяСсылка") Тогда
		Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован");
	КонецЕсли;
			
	Если Параметры <> Неопределено Тогда
        

        Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
            
            ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
            
            // Заполняем поля документа
            Если ЗначенияЗаполнения.Свойство("Врач") Тогда
                Объект.Врач = ЗначенияЗаполнения.Врач;
            КонецЕсли;
            
            Если ЗначенияЗаполнения.Свойство("ДатаВремяНачала") Тогда
                Объект.ДатаВремяНачала = ЗначенияЗаполнения.ДатаВремяНачала;
            КонецЕсли;
            
        КонецЕсли;
        
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.ПустаяСсылка") Тогда
		Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Запланирован");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗанятостьВрача() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Врач занят в выбранное время!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_Прием",, Объект.Ссылка);
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если Объект.Услуга <> Неопределено Тогда
        // Выполним запрос к базе данных, чтобы получить продолжительность услуги
        Продолжительность = ПолучитьПродолжительностьУслуги(Объект.Услуга);
        Объект.Продолжительность = Продолжительность;
    Иначе
        Объект.Продолжительность = 30;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Питомец) Тогда
		ПроверитьВремяПриёма();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяНачалаПриИзменении(Элемент)
	Если Объект.ДатаВремяНачала < ТекущаяДата() Тогда
		Объект.ДатаВремяНачала = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата начала приёма не может быть меньше сегодняшней даты!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ПроверитьВремяПриёма();
КонецПроцедуры
#КонецОбласти



&НаКлиенте
Асинх Процедура ОтменаПриёма(Команда)
	
	Ответ = Ждать ВопросАсинх("Вы действительно хотите отменить прием?", РежимДиалогаВопрос.ДаНет);
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        // Выполняем отмену на сервере
        ВыполнитьОтменуНаСервере();
    КонецЕсли;
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Приём успешно отменён!";
    Сообщение.Поле = "СтатусЗаписи";
    Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПроверитьЗанятостьВрача()
	
	ВремяОкончания = Объект.ДатаВремяНачала + Объект.Продолжительность * 60;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасписаниеВрачей.Врач КАК Врач,
		|	РасписаниеВрачей.ДатаВремяНачала КАК ДатаВремяНачала,
		|	РасписаниеВрачей.ДатаВремяОкончания КАК ДатаВремяОкончания,
		|	РасписаниеВрачей.Запись КАК Запись
		|ИЗ
		|	РегистрСведений.РасписаниеВрачей КАК РасписаниеВрачей
		|ГДЕ
		|	РасписаниеВрачей.Врач = &Врач
		|	И РасписаниеВрачей.ДатаВремяНачала < &ВремяОкончания
		|	И РасписаниеВрачей.ДатаВремяОкончания > &ДатаВремяНачала";
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + " |    И РасписаниеВрачей.Запись <> &ТекущаяЗапись";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Врач", Объект.Врач);
	Запрос.УстановитьПараметр("ДатаВремяНачала", Объект.ДатаВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("ТекущаяЗапись", Объект.Ссылка);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	
	Если Результат.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВремяПриёма()
	
	ДатаНачалаДня = НачалоДня(Объект.ДатаВремяНачала);

	НачалоРабочегоДня = ДатаНачалаДня + 9 * 3600; // 9:00
	КонецРабочегоДня = ДатаНачалаДня + 21 * 3600; // 21:00

	Если Объект.ДатаВремяНачала < НачалоРабочегоДня ИЛИ Объект.ДатаВремяНачала > КонецРабочегоДня Тогда
	    Объект.ДатаВремяНачала = Неопределено;
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = "Время начала приёма должно быть в рабочее время с 9:00 до 21:00!";
	    Сообщение.Сообщить();
	    Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Продолжительность) Тогда
	    ДатаВремяОкончания = Объект.ДатаВремяНачала + Объект.Продолжительность * 60;
	    
	    // Проверяем, что окончание не позже 21:00
	    Если ДатаВремяОкончания > КонецРабочегоДня Тогда
	        Объект.ДатаВремяНачала = Неопределено;
	        Сообщение = Новый СообщениеПользователю();
		    Сообщение.Текст = "Приём должен заканчиваться до 21:00!";
		    Сообщение.Сообщить();
	        Возврат;
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОтменуНаСервере()
    
    Объект.СтатусЗаписи = ПредопределенноеЗначение("Перечисление.СтатусыЗаписи.Отменен");
    ПараметрыЗаписи = Новый Структура();
    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
    ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
    Записать(ПараметрыЗаписи);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу)
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Услуги.Продолжительность КАК Продолжительность
        |ИЗ
        |	Справочник.Услуги КАК Услуги
        |ГДЕ
        |	Услуги.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаУслугу);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Продолжительность;
    Иначе
        Возврат 30;
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьПродолжительностьУслуги(СсылкаНаУслугу)
    Возврат ПолучитьПродолжительностьУслугиНаСервере(СсылкаНаУслугу);
КонецФункции

#КонецОбласти
