
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦенуТовара(Товар) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаТоварыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаТовары.СрезПоследних КАК ЦеныНаТоварыСрезПоследних
		|ГДЕ
		|	ЦеныНаТоварыСрезПоследних.Товар = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена для товара не найдена!";
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьЦенуУслуги(Услуга) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаУслугиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаУслуги.СрезПоследних КАК ЦеныНаУслугиСрезПоследних
		|ГДЕ
		|	ЦеныНаУслугиСрезПоследних.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена для услуги не найдена!";
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
