
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ПечатьОсмотра(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьОсмотра)
	Макет = Документы.Осмотр.ПолучитьМакет("ПечатьОсмотра");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ Осмотр.Питомец,
		|	Осмотр.Врач,
		|	Осмотр.ДатаОсмотра,
		|	Осмотр.Жалобы,
		|	Осмотр.ОбщееСостояние,
		|	Осмотр.Температура,
		|	Осмотр.Вес,
		|	Осмотр.Диагноз,
		|	Осмотр.Рекомендации,
		|	Осмотр.Назначения.(
		|		Товар,
		|		Дозировка,
		|		СпособПрименения,
		|		Периодичность,
		|		Продолжительность,
		|		Примечание)
		|ИЗ
		|	Документ.Осмотр КАК Осмотр
		|ГДЕ
		|	Осмотр.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНазначенияШапка = Макет.ПолучитьОбласть("НазначенияШапка");
	ОбластьНазначения = Макет.ПолучитьОбласть("Назначения");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьНазначенияШапка);
		ВыборкаНазначения = Выборка.Назначения.Выбрать();
		Пока ВыборкаНазначения.Следующий() Цикл
			ОбластьНазначения.Параметры.Заполнить(ВыборкаНазначения);
			ТабДок.Вывести(ОбластьНазначения, ВыборкаНазначения.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
