Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр РасписаниеВрачей
	Движения.РасписаниеВрачей.Записывать = Истина;
	Движение = Движения.РасписаниеВрачей.Добавить();
	Движение.Период = Дата;
	Движение.Врач = Врач;
	Движение.ДатаВремяНачала = ДатаВремяНачала;
	Движение.ДатаВремяОкончания = ДатаВремяНачала + (Продолжительность * 60);
	Движение.Услуга = Услуга;
	Движение.Запись = Ссылка;
	Движение.Питомец = Питомец;

КонецПроцедуры

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаВремяНачала) И ДатаВремяНачала < ТекущаяДатаСеанса() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата приёма не может быть меньше сегодняшней даты!";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "ДатаВремяНачала";
	КонецЕсли;
	
	Если Договор.ДатаНачала > ДатаВремяНачала ИЛИ Договор.ДатаОкончания < ДатаВремяНачала Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Дата приёма не совпадает с датой договора!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
#КонецОбласти
