
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодсчетВозраста(Объект.ДатаРождения);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработка параметра владельца при создании
    Если Параметры.Свойство("Владелец") Тогда
        Объект.Хозяин = Параметры.Владелец;
    КонецЕсли;
	
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	
	ПодсчетВозраста(Объект.ДатаРождения);
	
	Если Объект.ДатаРождения > ТекущаяДата() Тогда
		Объект.ДатаРождения = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата рождения не может быть больше, чем сегодняшняя дата!";
		Сообщение.Сообщить();
		Возраст = 0;
	КонецЕсли;
	
	Если Возраст >= 60 Тогда
		Возраст = 0;
		Объект.ДатаРождения = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите корректный возраст!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПодсчетВозраста(ДатаРождения)
	
	Если ДатаРождения = Неопределено ИЛИ ДатаРождения = '0001-01-01' Тогда
		Возраст = 0;
        Возврат Возраст;
    КонецЕсли;
    
    ТекДата = ТекущаяДатаСеанса();
    Возраст = Год(ТекДата) - Год(ДатаРождения);
    
    // Корректируем возраст, если день рождения в текущем году еще не наступил
    Если Месяц(ТекДата) < Месяц(ДатаРождения) Тогда
        Возраст = Возраст - 1;
    ИначеЕсли Месяц(ТекДата) = Месяц(ДатаРождения) И День(ТекДата) < День(ДатаРождения) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Возврат Возраст;
    
КонецФункции
#КонецОбласти
