
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодсчетВозраста(Объект.ДатаРождения);
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ПодсчетВозраста(Объект.ДатаРождения);
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПодсчетВозраста(ДатаРождения)
	
	Если ДатаРождения = Неопределено ИЛИ ДатаРождения = '0001-01-01' Тогда
		Возраст = 0;
        Возврат Возраст;
    КонецЕсли;
    
    ТекДата = ТекущаяДатаСеанса();
    Возраст = Год(ТекДата) - Год(ДатаРождения);
    
    // Корректируем возраст, если день рождения в текущем году еще не наступил
    Если Месяц(ТекДата) < Месяц(ДатаРождения) Тогда
        Возраст = Возраст - 1;
    ИначеЕсли Месяц(ТекДата) = Месяц(ДатаРождения) И День(ТекДата) < День(ДатаРождения) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Возврат Возраст;
    
КонецФункции
#КонецОбласти
