
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЗаписьНаПрием <> Неопределено Тогда
		ЗаполнитьДанныеИзЗаписиНаПрием();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗаписьНаПриемПриИзменении(Элемент)
	ЗаполнитьДанныеИзЗаписиНаПрием();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПосмотретьМедКарту(Команда)
    // Проверяем, что питомец выбран в документе
    Если Объект.Питомец = Неопределено Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Выберите питомца в документе!";
        Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    // Формируем параметры для формы регистра
    Структура = Новый Структура;
    Структура.Вставить("Питомец", Объект.Питомец); // Передаем ссылку на питомца
    
    // Открываем форму регистра с отбором
    Попытка
        Форма = ПолучитьФорму("РегистрСведений.МедицинскиеКарты.Форма.ФормаСписка", Структура);
        Форма.Открыть();
    Исключение
    	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Ошибка открытия формы медкарты";
        Сообщение.Сообщить();
        
    КонецПопытки;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗаполнитьДанныеИзЗаписиНаПрием()
	
	Если Объект.ЗаписьНаПрием = Неопределено Тогда
		
		Объект.Врач = Неопределено;
		Объект.Питомец = Неопределено;
		Объект.Хозяин = Неопределено;
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = ПолучитьДанныеИзЗаписиНаПрием(Объект.ЗаписьНаПрием);
	
	Если ДанныеЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Врач = ДанныеЗаписи.Врач;
	Объект.Питомец = ДанныеЗаписи.Питомец;
	Объект.Хозяин = ДанныеЗаписи.Клиент;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьДанныеИзЗаписиНаПрием(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьНаПрием.Клиент КАК Клиент,
		|	ЗаписьНаПрием.Питомец КАК Питомец,
		|	ЗаписьНаПрием.Врач КАК Врач
		|ИЗ
		|	Документ.ЗаписьНаПрием КАК ЗаписьНаПрием
		|ГДЕ
		|	ЗаписьНаПрием.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные = Новый Структура;
        Данные.Вставить("Врач", Выборка.Врач);
        Данные.Вставить("Питомец", Выборка.Питомец);
        Данные.Вставить("Клиент", Выборка.Клиент);
        Возврат Данные;
	Иначе
		Возврат Неопределено
	КонецЕсли;

КонецФункции

#КонецОбласти
