
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура МедКарта(Команда)
	Если Не ЗначениеЗаполнено(Объект.Питомец) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран питомец!";
		Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    ПараметрыОткрытия = Новый Структура();
    ПараметрыОткрытия.Вставить("Питомец", Объект.Питомец);
    
    ОткрытьФорму("РегистрСведений.МедицинскиеКарты.ФормаСписка", ПараметрыОткрытия);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ЗаписьНаПриемПриИзменении(Элемент)
	ЗаполнитьДанныеИзЗаписиНаПрием();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЗаписьНаПрием <> Неопределено Тогда
		ЗаполнитьДанныеИзЗаписиНаПрием();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаОсмотра = ТекущаяДата();
	Объект.СтатусОсмотра = Перечисления.СтатусыОсмотра.Черновик;
	
	СсылкаНаЗапись = Объект.ЗаписьНаПрием.ПолучитьОбъект();
	СсылкаНаЗапись.СтатусЗаписи = Перечисления.СтатусыЗаписи.ВРаботе;
	СсылкаНаЗапись.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СсылкаНаЗапись = Объект.ЗаписьНаПрием.ПолучитьОбъект();
	СсылкаНаЗапись.СтатусЗаписи = Перечисления.СтатусыЗаписи.Выполнен;
	СсылкаНаЗапись.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.СтатусОсмотра = ПредопределенноеЗначение("Перечисление.СтатусыОсмотра.Черновик") 
	ИЛИ Объект.СтатусОсмотра = ПредопределенноеЗначение("Перечисление.СтатусыОсмотра.ПустаяСсылка") Тогда
		Ответ = Ждать ВопросАсинх("Осмотр завершён?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СтатусОсмотра = ПредопределенноеЗначение("Перечисление.СтатусыОсмотра.Завершен");
			ПараметрыЗаписи = Новый Структура();
		    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		    ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Оперативный);
		    Записать(ПараметрыЗаписи);		    
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаОсмотраПриИзменении(Элемент)
	Если Объект.ДатаОсмотра > ТекущаяДата() Тогда
		Объект.ДатаОсмотра = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата осмотра не может быть больше сегодняшней даты!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОказанныеУслуги
&НаКлиенте
Процедура ОказанныеУслугиУслугаСоздание(Элемент, СтандартнаяОбработка)
	
	СтрокаТЧ = Элементы.ОказанныеУслуги.ТекущиеДанные;
		
	ПодставитьКоличествоПоУмолчанию(СтрокаТЧ);

КонецПроцедуры

&НаКлиенте
Процедура ОказанныеУслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ОказанныеУслуги.ТекущиеДанные;
	
	ПодставитьКоличествоПоУмолчанию(СтрокаТЧ);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодставитьКоличествоПоУмолчанию(СтрокаТЧ) 
	
	Если СтрокаТЧ.Количество <= 0 Или СтрокаТЧ.Количество = Неопределено Тогда
        СтрокаТЧ.Количество = 1;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеИзЗаписиНаПрием()
	
	Если Объект.ЗаписьНаПрием = Неопределено Тогда
		
		Объект.Врач = Неопределено;
		Объект.Питомец = Неопределено;
		Объект.Хозяин = Неопределено;
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = ПолучитьДанныеИзЗаписиНаПрием(Объект.ЗаписьНаПрием);
	
	Если ДанныеЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Врач = ДанныеЗаписи.Врач;
	Объект.Питомец = ДанныеЗаписи.Питомец;
	Объект.Хозяин = ДанныеЗаписи.Клиент;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьДанныеИзЗаписиНаПрием(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьНаПрием.Клиент КАК Клиент,
		|	ЗаписьНаПрием.Питомец КАК Питомец,
		|	ЗаписьНаПрием.Врач КАК Врач
		|ИЗ
		|	Документ.ЗаписьНаПрием КАК ЗаписьНаПрием
		|ГДЕ
		|	ЗаписьНаПрием.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные = Новый Структура;
        Данные.Вставить("Врач", Выборка.Врач);
        Данные.Вставить("Питомец", Выборка.Питомец);
        Данные.Вставить("Клиент", Выборка.Клиент);
        Возврат Данные;
	Иначе
		Возврат Неопределено
	КонецЕсли;

КонецФункции
#КонецОбласти
