

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Осмотр") Тогда
		// Заполнение шапки
		Осмотр = ДанныеЗаполнения.Ссылка;
		Клиент = ДанныеЗаполнения.Хозяин;

		Для Каждого ТекСтрокаНазначения из ДанныеЗаполнения.Назначения Цикл
			НоваяСтрока = ПозицииТоваров.Добавить();
			НоваяСтрока.Товар = ТекСтрокаНазначения.Товар;
		КонецЦикла;

		Для Каждого ТекСтрокаОказанныеУслуги из ДанныеЗаполнения.ОказанныеУслуги Цикл
			НоваяСтрока = ПозицииУслуг.Добавить();
			НоваяСтрока.Услуга = ТекСтрокаОказанныеУслуги.Услуга;
			НоваяСтрока.Количество = ТекСтрокаОказанныеУслуги.Количество;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
