
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПитомцев();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьПитомцев(Команда)
	ЗаполнитьПитомцев();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПитомцев()
	
	Объект.Питомцы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Питомцы.ВидЖивотного КАК ВидЖивотного,
	|	Питомцы.ПородаЖивотного КАК ПородаЖивотного,
	|	Питомцы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Питомцы КАК Питомцы
	|ГДЕ
	|	Питомцы.Хозяин = &Хозяин";
	
	Запрос.УстановитьПараметр("Хозяин", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Питомцы.Добавить();
		НоваяСтрока.Кличка = Выборка.Ссылка;
		НоваяСтрока.ВидЖивотного = Выборка.ВидЖивотного;
		НоваяСтрока.ПородаЖивотного = Выборка.ПородаЖивотного
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
