
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ИдентификаторПользователяИБ = ТекущийПользователь.УникальныйИдентификатор;
	ПараметрыСеанса.ТекущийПользователь = 
		Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
